In [15]:
import pandas as pd
obj = pd.Series([1,2,3,4,5], index=range(3,8,1))
obj.name='adg'
obj.index.name ='qwr'
obj

qwr
3    1
4    2
5    3
6    4
7    5
Name: adg, dtype: int64

In [16]:
obj2=pd.Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])
obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [20]:
obj3=obj2.reindex(['a','b','c','d','e'], fill_value=0)
obj3

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [29]:
obj4=pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj4.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [62]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'], columns=['Ohio', 'Texas', 'California'])
states=['Texas', 'Utah','California']
frame2=frame.loc[['a','b','c','d'], states]
frame2.Utah.notnull()

a    False
b    False
c    False
d    False
Name: Utah, dtype: bool

In [68]:
series3=pd.Series(frame2.Texas)
series3.drop('b')
series3.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [74]:
frame2.drop(['Texas', 'Utah'], axis=1).drop('b', axis=0)

   California
a         2.0
c         5.0
d         8.0

In [77]:
series4=pd.Series(np.arange(4), index=['a','b','c','d'])
series4[series4<2]

a    0
b    1
dtype: int32

In [87]:
frame5=pd.DataFrame(np.arange(16).reshape(4,4), index=['Ohio','Colorado','Utah','New York'], columns=['one','two','three', 'four'])
frame5[frame5.two>5]=0
frame5

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        0    0      0     0
New York    0    0      0     0

In [91]:
arr1=np.arange(12).reshape(3,4)
arr1=arr1-arr1[0]
arr1

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [96]:
import random
frame6=pd.DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame6.apply(lambda x: x.max()-x.min(), axis=1)

Utah      2.066901
Ohio      1.246152
Texas     1.487129
Oregon    1.757990
dtype: float64

In [102]:
def func1(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame6.apply(func1, axis=1)

             min       max
Utah   -1.273733  0.793168
Ohio   -0.024797  1.221356
Texas  -0.388640  1.098489
Oregon -1.040974  0.717015

In [110]:
series5=pd.Series(frame5.loc['Ohio'])
series5.rank()

one      1.0
two      2.0
three    3.0
four     4.0
Name: Ohio, dtype: float64